Autodesk.Revit.DB.DirectContext3D.IDirectContext3DHandleServer.Match(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Returns true if current server represents the specified handle / instance.
Since:
2023

Autodesk.Revit.DB.DirectContext3D.IDirectContext3DHandleServer.GetHandleId
Reports the id of the Handle element that the server is associated with.
Remarks:
In the current release servers that use handle elements can only work with internal addins.
Third-party implementers should return ElementId.invalidElementId.
Returns:
The id of the Handle element.
Since:
2021

Autodesk.Revit.DB.DirectContext3D.IDirectContext3DHandleServer
The interface to be implemented by a server that is connected to a handle.
Since:
2021